{
  "name": {
    "en": "Virtual Occupancy Sensor",
    "nl": "Virtuele Bezettingssensor",
    "de": "Virtueller Anwesenheitssensor",
    "fr": "Capteur d'Occupation Virtuel",
    "no": "Virtuell Tilstedeværelsessensor",
    "sv": "Virtuell Närvarosensor",
    "da": "Virtuel Tilstedeværelsessensor",
    "es": "Sensor de Ocupación Virtual",
    "it": "Sensore di Occupazione Virtuale"
  },
  "class": "sensor",
  "capabilities": [
    "alarm_motion",
    "occupancy_state"
  ],
  "capabilitiesOptions": {
    "alarm_motion": {
      "title": {
        "en": "Motion",
        "nl": "Beweging",
        "de": "Bewegung",
        "fr": "Mouvement",
        "no": "Bevegelse",
        "sv": "Rörelse",
        "da": "Bevægelse",
        "es": "Movimiento",
        "it": "Movimento"
      }
    }
  },
  "platforms": [
    "local"
  ],
  "connectivity": [],
  "images": {
    "small": "/drivers/virtual-occupancy-sensor/assets/images/small.png",
    "large": "/drivers/virtual-occupancy-sensor/assets/images/large.png",
    "xlarge": "/drivers/virtual-occupancy-sensor/assets/images/xlarge.png"
  },
  "pair": [
    {
      "id": "list_devices",
      "template": "list_devices",
      "navigation": {
        "next": "add_devices"
      }
    },
    {
      "id": "add_devices",
      "template": "add_devices"
    }
  ],
  "settings": [
    {
      "type": "group",
      "label": {
        "en": "Detection Settings",
        "nl": "Detectie-instellingen",
        "de": "Erkennungseinstellungen",
        "fr": "Paramètres de détection",
        "no": "Deteksjonsinnstillinger",
        "sv": "Detektionsinställningar",
        "da": "Detektionsindstillinger",
        "es": "Ajustes de detección",
        "it": "Impostazioni di rilevamento"
      },
      "children": [
        {
          "id": "motion_timeout",
          "type": "number",
          "label": {
            "en": "Default motion detection timeout (seconds)",
            "nl": "Standaard time-out bewegingsdetectie (seconden)",
            "de": "Standard-Timeout für Bewegungserkennung (Sekunden)",
            "fr": "Délai de détection de mouvement par défaut (secondes)",
            "no": "Standard tidsavbrudd for bevegelsesdeteksjon (sekunder)",
            "sv": "Standard tidsgräns för rörelsedetektering (sekunder)",
            "da": "Standard tidsudløb for bevægelsesdetektering (sekunder)",
            "es": "Tiempo de espera de detección de movimiento predeterminado (segundos)",
            "it": "Timeout rilevamento movimento predefinito (secondi)"
          },
          "hint": {
            "en": "Set this to match your motion sensor's timeout (blind time). A lower value results in faster and more accurate occupancy detection. If auto-learning is enabled, this is used as the initial value until the sensor learns the actual blind time.",
            "nl": "Stel dit in op de time-out (blinde tijd) van uw bewegingssensor. Een lagere waarde resulteert in snellere en nauwkeurigere bezettingsdetectie. Als automatisch leren is ingeschakeld, wordt dit gebruikt als initiële waarde totdat de sensor de werkelijke blinde tijd leert.",
            "de": "Stellen Sie dies auf den Timeout (Blindzeit) Ihres Bewegungssensors ein. Ein niedrigerer Wert führt zu schnellerer und genauerer Anwesenheitserkennung. Wenn automatisches Lernen aktiviert ist, wird dies als Anfangswert verwendet, bis der Sensor die tatsächliche Blindzeit lernt.",
            "fr": "Réglez cette valeur sur le délai (temps aveugle) de votre capteur de mouvement. Une valeur plus basse permet une détection d'occupation plus rapide et plus précise. Si l'apprentissage automatique est activé, cette valeur est utilisée comme valeur initiale jusqu'à ce que le capteur apprenne le temps aveugle réel.",
            "no": "Sett denne til å matche bevegelsessensorens tidsavbrudd (blindtid). En lavere verdi gir raskere og mer nøyaktig tilstedeværelsesdeteksjon. Hvis automatisk læring er aktivert, brukes dette som startverdi til sensoren lærer den faktiske blindtiden.",
            "sv": "Ställ in detta så att det matchar din rörelsesensors tidsgräns (blindtid). Ett lägre värde ger snabbare och mer exakt närvarodetektering. Om automatisk inlärning är aktiverad används detta som startvärde tills sensorn lär sig den faktiska blindtiden.",
            "da": "Indstil dette til at matche din bevægelsessensors tidsudløb (blindtid). En lavere værdi resulterer i hurtigere og mere præcis tilstedeværelsesdetektering. Hvis automatisk indlæring er aktiveret, bruges dette som startværdi, indtil sensoren lærer den faktiske blindtid.",
            "es": "Configure esto para que coincida con el tiempo de espera (tiempo ciego) de su sensor de movimiento. Un valor más bajo resulta en una detección de ocupación más rápida y precisa. Si el aprendizaje automático está habilitado, esto se usa como valor inicial hasta que el sensor aprenda el tiempo ciego real.",
            "it": "Imposta questo valore in base al timeout (tempo cieco) del tuo sensore di movimento. Un valore più basso consente un rilevamento dell'occupazione più rapido e preciso. Se l'apprendimento automatico è abilitato, questo viene utilizzato come valore iniziale finché il sensore non apprende il tempo cieco effettivo."
          },
          "value": 30,
          "min": 5,
          "max": 300,
          "units": {
            "en": "seconds",
            "nl": "seconden",
            "de": "Sekunden",
            "fr": "secondes",
            "no": "sekunder",
            "sv": "sekunder",
            "da": "sekunder",
            "es": "segundos",
            "it": "secondi"
          }
        },
        {
          "id": "auto_learn_timeout",
          "type": "checkbox",
          "label": {
            "en": "Auto-learn motion sensor timeout",
            "nl": "Automatisch time-out bewegingssensor leren",
            "de": "Bewegungssensor-Timeout automatisch lernen",
            "fr": "Apprendre automatiquement le délai du capteur de mouvement",
            "no": "Automatisk lær tidsavbrudd for bevegelsessensor",
            "sv": "Automatiskt lär in rörelsesensorns tidsgräns",
            "da": "Automatisk lær bevægelsessensorens tidsudløb",
            "es": "Aprender automáticamente el tiempo de espera del sensor de movimiento",
            "it": "Apprendimento automatico timeout sensore movimento"
          },
          "hint": {
            "en": "When enabled, the sensor learns the blind time of your motion sensors by observing how long they stay active. This works best with a single motion sensor. With multiple motion sensors having different timeouts, the learned value may be inaccurate and cause premature 'empty' detection.",
            "nl": "Indien ingeschakeld, leert de sensor de blinde tijd van uw bewegingssensoren door te observeren hoe lang ze actief blijven. Dit werkt het beste met één bewegingssensor. Bij meerdere bewegingssensoren met verschillende time-outs kan de geleerde waarde onnauwkeurig zijn en leiden tot voortijdige 'leeg' detectie.",
            "de": "Wenn aktiviert, lernt der Sensor die Blindzeit Ihrer Bewegungssensoren, indem er beobachtet, wie lange sie aktiv bleiben. Dies funktioniert am besten mit einem einzelnen Bewegungssensor. Bei mehreren Bewegungssensoren mit unterschiedlichen Timeouts kann der gelernte Wert ungenau sein und zu vorzeitiger 'Leer'-Erkennung führen.",
            "fr": "Lorsque activé, le capteur apprend le temps aveugle de vos capteurs de mouvement en observant combien de temps ils restent actifs. Cela fonctionne mieux avec un seul capteur de mouvement. Avec plusieurs capteurs de mouvement ayant des délais différents, la valeur apprise peut être inexacte et provoquer une détection prématurée de 'vide'.",
            "no": "Når aktivert, lærer sensoren blindtiden til bevegelsessensorene dine ved å observere hvor lenge de forblir aktive. Dette fungerer best med én bevegelsessensor. Med flere bevegelsessensorer med forskjellige tidsavbrudd kan den lærte verdien være unøyaktig og føre til for tidlig 'tomt' deteksjon.",
            "sv": "När aktiverad lär sig sensorn blindtiden för dina rörelsesensorer genom att observera hur länge de förblir aktiva. Detta fungerar bäst med en enda rörelsesensor. Med flera rörelsesensorer med olika tidsgränser kan det inlärda värdet vara felaktigt och orsaka för tidig 'tom' detektering.",
            "da": "Når aktiveret, lærer sensoren blindtiden for dine bevægelsessensorer ved at observere, hvor længe de forbliver aktive. Dette fungerer bedst med en enkelt bevægelsessensor. Med flere bevægelsessensorer med forskellige tidsudløb kan den indlærte værdi være unøjagtig og forårsage for tidlig 'tom' detektion.",
            "es": "Cuando está habilitado, el sensor aprende el tiempo ciego de sus sensores de movimiento observando cuánto tiempo permanecen activos. Esto funciona mejor con un solo sensor de movimiento. Con múltiples sensores de movimiento con diferentes tiempos de espera, el valor aprendido puede ser inexacto y causar detección prematura de 'vacío'.",
            "it": "Quando abilitato, il sensore apprende il tempo cieco dei tuoi sensori di movimento osservando quanto tempo rimangono attivi. Funziona meglio con un singolo sensore di movimento. Con più sensori di movimento con timeout diversi, il valore appreso potrebbe essere impreciso e causare un rilevamento prematuro di 'vuoto'."
          },
          "value": true
        },
        {
          "id": "active_on_occupied",
          "type": "checkbox",
          "label": {
            "en": "Zone active when occupied",
            "nl": "Zone actief wanneer bezet",
            "de": "Zone aktiv, wenn belegt",
            "fr": "Zone active lorsque occupé",
            "no": "Sone aktiv når opptatt",
            "sv": "Zon aktiv när upptagen",
            "da": "Zone aktiv når optaget",
            "es": "Zona activa cuando ocupada",
            "it": "Zona attiva quando occupata"
          },
          "hint": {
            "en": "If enabled, the virtual sensor will report motion (alarm_motion: true) while the room is occupied.",
            "nl": "Indien ingeschakeld, meldt de virtuele sensor beweging (alarm_motion: true) terwijl de kamer bezet is.",
            "de": "Wenn aktiviert, meldet der virtuelle Sensor Bewegung (alarm_motion: true), während der Raum belegt ist.",
            "fr": "Si activé, le capteur virtuel signalera un mouvement (alarm_motion: true) tant que la pièce est occupée.",
            "no": "Hvis aktivert, vil den virtuelle sensoren rapportere bevegelse (alarm_motion: true) mens rommet er opptatt.",
            "sv": "Om aktiverad kommer den virtuella sensorn att rapportera rörelse (alarm_motion: true) medan rummet är upptaget.",
            "da": "Hvis aktiveret, vil den virtuelle sensor rapportere bevægelse (alarm_motion: true), mens rummet er optaget.",
            "es": "Si está habilitado, el sensor virtual reportará movimiento (alarm_motion: true) mientras la habitación esté ocupada.",
            "it": "Se abilitato, il sensore virtuale segnalerà movimento (alarm_motion: true) mentre la stanza è occupata."
          },
          "value": true
        },
        {
          "id": "active_on_empty",
          "type": "checkbox",
          "label": {
            "en": "Zone active when empty",
            "nl": "Zone actief wanneer leeg",
            "de": "Zone aktiv, wenn leer",
            "fr": "Zone active lorsque vide",
            "no": "Sone aktiv når tomt",
            "sv": "Zon aktiv när tomt",
            "da": "Zone aktiv når tomt",
            "es": "Zona activa cuando vacía",
            "it": "Zona attiva quando vuota"
          },
          "hint": {
            "en": "If enabled, the virtual sensor will report motion (alarm_motion: true) while the room is empty.",
            "nl": "Indien ingeschakeld, meldt de virtuele sensor beweging (alarm_motion: true) terwijl de kamer leeg is.",
            "de": "Wenn aktiviert, meldet der virtuelle Sensor Bewegung (alarm_motion: true), während der Raum leer ist.",
            "fr": "Si activé, le capteur virtuel signalera un mouvement (alarm_motion: true) tant que la pièce est vide.",
            "no": "Hvis aktivert, vil den virtuelle sensoren rapportere bevegelse (alarm_motion: true) mens rommet er tomt.",
            "sv": "Om aktiverad kommer den virtuella sensorn att rapportera rörelse (alarm_motion: true) medan rummet är tomt.",
            "da": "Hvis aktiveret, vil den virtuelle sensor rapportere bevægelse (alarm_motion: true), mens rummet er tomt.",
            "es": "Si está habilitado, el sensor virtual reportará movimiento (alarm_motion: true) mientras la habitación esté vacía.",
            "it": "Se abilitato, il sensore virtuale segnalerà movimento (alarm_motion: true) mentre la stanza è vuota."
          },
          "value": false
        },
        {
          "id": "active_on_door_open",
          "type": "checkbox",
          "label": {
            "en": "Zone active when door is open",
            "nl": "Zone actief wanneer deur open is",
            "de": "Zone aktiv, wenn Tür offen ist",
            "fr": "Zone active lorsque la porte est ouverte",
            "no": "Sone aktiv når døren er åpen",
            "sv": "Zon aktiv när dörren är öppen",
            "da": "Zone aktiv når døren er åben",
            "es": "Zona activa cuando la puerta está abierta",
            "it": "Zona attiva quando la porta è aperta"
          },
          "hint": {
            "en": "If enabled, the virtual sensor will report motion (alarm_motion: true) while the door is open.",
            "nl": "Indien ingeschakeld, meldt de virtuele sensor beweging (alarm_motion: true) terwijl de deur open is.",
            "de": "Wenn aktiviert, meldet der virtuelle Sensor Bewegung (alarm_motion: true), während die Tür offen ist.",
            "fr": "Si activé, le capteur virtuel signalera un mouvement (alarm_motion: true) tant que la porte est ouverte.",
            "no": "Hvis aktivert, vil den virtuelle sensoren rapportere bevegelse (alarm_motion: true) mens døren er åpen.",
            "sv": "Om aktiverad kommer den virtuella sensorn att rapportera rörelse (alarm_motion: true) medan dörren är öppen.",
            "da": "Hvis aktiveret, vil den virtuelle sensor rapportere bevægelse (alarm_motion: true), mens døren er åben.",
            "es": "Si está habilitado, el sensor virtual reportará movimiento (alarm_motion: true) mientras la puerta esté abierta.",
            "it": "Se abilitato, il sensore virtuale segnalerà movimento (alarm_motion: true) mentre la porta è aperta."
          },
          "value": true
        },
        {
          "id": "active_on_checking",
          "type": "checkbox",
          "label": {
            "en": "Zone active when checking",
            "nl": "Zone actief tijdens controleren",
            "de": "Zone aktiv beim Prüfen",
            "fr": "Zone active lors de la vérification",
            "no": "Sone aktiv ved sjekking",
            "sv": "Zon aktiv vid kontroll",
            "da": "Zone aktiv ved kontrol",
            "es": "Zona activa durante la comprobación",
            "it": "Zona attiva durante il controllo"
          },
          "hint": {
            "en": "If enabled, the virtual sensor will report motion (alarm_motion: true) while checking for motion after door closes.",
            "nl": "Indien ingeschakeld, meldt de virtuele sensor beweging (alarm_motion: true) tijdens het controleren op beweging nadat de deur is gesloten.",
            "de": "Wenn aktiviert, meldet der virtuelle Sensor Bewegung (alarm_motion: true), während nach dem Schließen der Tür auf Bewegung geprüft wird.",
            "fr": "Si activé, le capteur virtuel signalera un mouvement (alarm_motion: true) pendant la vérification de mouvement après la fermeture de la porte.",
            "no": "Hvis aktivert, vil den virtuelle sensoren rapportere bevegelse (alarm_motion: true) mens den sjekker for bevegelse etter at døren lukkes.",
            "sv": "Om aktiverad kommer den virtuella sensorn att rapportera rörelse (alarm_motion: true) medan den kontrollerar rörelse efter att dörren stängts.",
            "da": "Hvis aktiveret, vil den virtuelle sensor rapportere bevægelse (alarm_motion: true), mens den tjekker for bevægelse, efter at døren lukkes.",
            "es": "Si está habilitado, el sensor virtual reportará movimiento (alarm_motion: true) mientras comprueba si hay movimiento después de cerrarse la puerta.",
            "it": "Se abilitato, il sensore virtuale segnalerà movimento (alarm_motion: true) mentre controlla il movimento dopo la chiusura della porta."
          },
          "value": false
        }
      ]
    },
    {
      "type": "group",
      "label": {
        "en": "Manual Sensor Configuration (Optional)",
        "nl": "Handmatige sensorconfiguratie (Optioneel)",
        "de": "Manuelle Sensorkonfiguration (Optional)",
        "fr": "Configuration manuelle des capteurs (Optionnel)",
        "no": "Manuell sensorkonfigurasjon (Valgfritt)",
        "sv": "Manuell sensorkonfiguration (Valfritt)",
        "da": "Manuel sensorkonfiguration (Valgfrit)",
        "es": "Configuración manual de sensores (Opcional)",
        "it": "Configurazione manuale sensori (Opzionale)"
      },
      "children": [
        {
          "id": "door_sensors",
          "type": "text",
          "label": {
            "en": "Door sensor device IDs (comma-separated)",
            "nl": "Deursensor apparaat-ID's (komma-gescheiden)",
            "de": "Türsensor-Geräte-IDs (kommagetrennt)",
            "fr": "IDs des capteurs de porte (séparés par des virgules)",
            "no": "Dørsensor enhets-IDer (komma-separert)",
            "sv": "Dörrsensor enhets-ID:n (komma-separerad)",
            "da": "Dørsensor enheds-ID'er (komma-separeret)",
            "es": "IDs de dispositivos de sensor de puerta (separados por comas)",
            "it": "ID dispositivi sensore porta (separati da virgola)"
          },
          "hint": {
            "en": "OPTIONAL: Leave empty to auto-detect sensors in the same room. Only use this if you want to manually specify door sensors from other rooms.",
            "nl": "OPTIONEEL: Laat leeg om sensoren in dezelfde kamer automatisch te detecteren. Gebruik dit alleen als u handmatig deursensoren uit andere kamers wilt opgeven.",
            "de": "OPTIONAL: Leer lassen, um Sensoren im selben Raum automatisch zu erkennen. Verwenden Sie dies nur, wenn Sie Türsensoren aus anderen Räumen manuell angeben möchten.",
            "fr": "OPTIONNEL: Laisser vide pour détecter automatiquement les capteurs dans la même pièce. Utilisez ceci uniquement si vous souhaitez spécifier manuellement des capteurs de porte d'autres pièces.",
            "no": "VALGFRITT: La stå tomt for å oppdage sensorer i samme rom automatisk. Bruk dette bare hvis du vil angi dørsensorer fra andre rom manuelt.",
            "sv": "VALFRITT: Lämna tomt för att automatiskt upptäcka sensorer i samma rum. Använd endast detta om du vill ange dörrsensorer från andra rum manuellt.",
            "da": "VALGFRIT: Lad stå tomt for automatisk at registrere sensorer i samme rum. Brug kun dette, hvis du manuelt vil angive dørsensorer fra andre rum.",
            "es": "OPCIONAL: Dejar vacío para detectar automáticamente sensores en la misma habitación. Use esto solo si desea especificar manualmente sensores de puerta de otras habitaciones.",
            "it": "OPZIONALE: Lasciare vuoto per rilevare automaticamente i sensori nella stessa stanza. Usare solo se si desidera specificare manualmente sensori porta di altre stanze."
          },
          "value": ""
        },
        {
          "id": "motion_sensors",
          "type": "text",
          "label": {
            "en": "Motion sensor device IDs (comma-separated)",
            "nl": "Bewegingssensor apparaat-ID's (komma-gescheiden)",
            "de": "Bewegungssensor-Geräte-IDs (kommagetrennt)",
            "fr": "IDs des capteurs de mouvement (séparés par des virgules)",
            "no": "Bevegelsessensor enhets-IDer (komma-separert)",
            "sv": "Rörelsesensor enhets-ID:n (komma-separerad)",
            "da": "Bevægelsessensor enheds-ID'er (komma-separeret)",
            "es": "IDs de dispositivos de sensor de movimiento (separados por comas)",
            "it": "ID dispositivi sensore movimento (separati da virgola)"
          },
          "hint": {
            "en": "OPTIONAL: Leave empty to auto-detect sensors in the same room. Only use this if you want to manually specify motion sensors from other rooms.",
            "nl": "OPTIONEEL: Laat leeg om sensoren in dezelfde kamer automatisch te detecteren. Gebruik dit alleen als u handmatig bewegingssensoren uit andere kamers wilt opgeven.",
            "de": "OPTIONAL: Leer lassen, um Sensoren im selben Raum automatisch zu erkennen. Verwenden Sie dies nur, wenn Sie Bewegungssensoren aus anderen Räumen manuell angeben möchten.",
            "fr": "OPTIONNEL: Laisser vide pour détecter automatiquement les capteurs dans la même pièce. Utilisez ceci uniquement si vous souhaitez spécifier manuellement des capteurs de mouvement d'autres pièces.",
            "no": "VALGFRITT: La stå tomt for å oppdage sensorer i samme rom automatisk. Bruk dette bare hvis du vil angi bevegelsessensorer fra andre rom manuelt.",
            "sv": "VALFRITT: Lämna tomt för att automatiskt upptäcka sensorer i samma rum. Använd endast detta om du vill ange rörelsesensorer från andra rum manuellt.",
            "da": "VALGFRIT: Lad stå tomt for automatisk at registrere sensorer i samme rum. Brug kun dette, hvis du manuelt vil angive bevægelsessensorer fra andre rum.",
            "es": "OPCIONAL: Dejar vacío para detectar automáticamente sensores en la misma habitación. Use esto solo si desea especificar manualmente sensores de movimiento de otras habitaciones.",
            "it": "OPZIONALE: Lasciare vuoto per rilevare automaticamente i sensori nella stessa stanza. Usare solo se si desidera specificare manualmente sensori movimento di altre stanze."
          },
          "value": ""
        }
      ]
    }
  ]
}
